import type { Content, Titles } from '../types.js';

export const ru: Content = {
  personal: {
    name: 'Полина Якунина',
    job: 'Frontend-разработчик',
    email: 'yakuninadev@gmail.com',
    phone: '+7 (953) 971-75-08',
    tg: '@p67sultan',
  },
  about: {
    description:
      'Frontend-разработчик с 5+ годами коммерческого опыта в React и TypeScript. Имею опыт разработки сложных production-приложений, GraphQL и Apollo Federation, state management и интеграций с внешними сервисами. Особенно интересны миграции, рефакторинг legacy-кода, декомпозиция и техническая проработка проектов',
  },
  hardSkills: [
    'React',
    'TypeScript',
    'Redux',
    'Effector',
    'GraphQL',
    'Jest',
    'Next.js',
    'Figma',
  ],
  softSkills: [],
  experience: [
    {
      dates: '2023 - 2026',
      job: 'Senior Fronted Developer',
      companyName: 'Merlion (подразделение Ситилинк)',
      companyLink: 'https://www.citilink.ru/',
      companyDescription: 'Интернет-магазин техники, 460к пользователей в день',
      jobDescription:
        'Разработка и развитие страниц основного интернет-магазина: корзина, оформление и оплата заказов, история заказов.',
      team: '3–5 FE-разработчиков, 3–4 BE-разработчика, 1–2 QA, системный аналитик, DB-специалист, PO, Team Lead, FE Tech Lead.',
      stack:
        'React, TypeScript, GraphQL, Apollo Federation, Effector, Redux, gRPC, Jest, Next.js, микрофронтендная архитектура',
      tasks: [
        {
          title: 'Разработка и поддержка клиентской части веб-приложения (SSR)',
          description:
            'Страницы в зоне ответственности: корзина, оформление и оплата заказа, страница оформленного заказа, история заказов. Написание unit и e2e тестов.',
        },
        {
          title: 'Ежедневное code review, менторство',
          description:
            'Регулярное ревью задач, ревью разработчиков из соседних команд; онбординг и менторство около 7 frontend-разработчиков, проведение внутренних разборов и мини-воркшопов по Effector, GraphQL тестированию.',
        },
        {
          title: 'Разработка subgraph-а GraphQL',
          description:
            'Проектирование схем в рамках spec-first подхода, queries и mutations, работа с Apollo Federation и entities, взаимодействие с subgraph-ами соседних команд.',
        },
        {
          title:
            'Лидирование и разработка проектов по миграциям и крупным рефакторингам',
          description:
            'C gRPC на GraphQL, с Redux Thunk на Effector, с JavaScript на TypeScript, с class components на functional components. Декомпозиция, перенос, адаптация существующей бизнес-логики в процессе поэтапной миграции.',
        },

        // todo: в кейсы
        {
          title:
            'Полная переработка legacy-блока доставки на странице оформления заказа',
          description:
            'Декомпозиция, восстановление и согласование бизнес-логики, миграция состояния на Effector. Проект стал основой для последующей переработки соответствующей backend-логики.',
        },
        // todo: в кейсы
        {
          title:
            'Разработка интеграций с Яндекс.Сплит, DaData, СБП, SberPay и другими сервисами',
          description:
            'Изучение API/SDK, проработка пограничных кейсов, реализация и сопровождение до и после релиза.',
        },
        // todo: в кейсы
        {
          title: 'Редизайн страницы оформления заказа',
          description:
            'Декомпозиция проекта на отдельные блоки, проработка решений с дизайном и продуктом, планирование поэтапного перехода, проектирование и сопровождение трёх A/B тестирований.',
        },
        {
          title: 'Ведение сквозных frontend-проектов',
          description:
            'Tехническая проработка, декомпозиция, документация, распределение задач и сопровождение реализации. Проекты такие как новые функции сайта (список получателей заказа, общие рекламные акции на разны страницах сайта)',
        },
        {
          title: 'Разработка внутренних npm-пакетов',
          description:
            'Пакеты с переиспользуемой бизнес-логикой, включая полный мейнтейн одного из пакетов, участие в развитии общих пакетов и UI Kit.',
        },
        {
          title: 'Архитектура',
          description:
            'Участие в проработке API backend, декомпозиция крупных задач, согласование структуры и разделения ответственности subgraphs и React-приложениях.',
        },
        {
          title: 'Использование LLM в разработке',
          description:
            'Подготовка контекста, генерация и анализ кода, рефакторинг, поиск решений и проверка результатов.',
        },
      ],

      // todo: дописать описание кейсов
      cases: [
        {
          title:
            'Полная переработка legacy-блока доставки заказа на странице оформления заказа',
          description:
            'Существовало большое количество legacy-кода в блоке доставки. Архитектура BE требовала переработки. Разработка в этом блоке была затруднена. Требовалось восстановить бизнес-требования к блоку, улучшить опыт работы с с блоком доставки, провести рефакторинг. Также необходимо перевести блок c Redux на Effector',
          extra: [
            {
              name: 'Личный вклад',
              value:
                'Декомпозиция, восстановление и согласование бизнес-логики, составление блок-схемы юзер сценариев работы с заполнением доставки, личная переработка кода, составление архитектуры. Миграция состояния на Effector. Коллаборация с BE и составление ТЗ для BE. Плотное тестирование с QA',
            },
            {
              name: 'Результат',
              value:
                'Рефакторинг успешно запущен в проде без критических багов. Составлен план действий по дальнейшим шагам: менее критичные доработки на BE, ТЗ для проработки бизнес логики. По блок-схеме успешно ориентируются коллеги при работе с блоком доставки. Проработан и запущен план переработки соответствующей backend-логики.',
            },
          ],
        },
        {
          title: 'Редизайн страницы оформления заказа',
          description:
            'Декомпозиция проекта на отдельные блоки, проработка решений с дизайном и продуктом, планирование поэтапного перехода, проектирование и сопровождение трёх A/B тестирований.',
          extra: [
            { name: 'Личный вклад', value: '' },
            { name: 'Результат', value: '' },
          ],
        },
        {
          title:
            'Интеграции с Яндекс.Сплит, DaData, СБП, SberPay и другими сервисами',
          description:
            'Изучение API/SDK, проработка пограничных кейсов, согласование ТЗ',
          extra: [
            { name: 'Личный вклад', value: '' },
            { name: 'Результат', value: '' },
          ],
        },
      ],
    },
    {
      dates: '2021 - 2023',
      job: 'Middle- frontend-разработчик',
      jobDescription:
        'Разработка и развитие модуля личного кабинета обучающегося в составе корпоративного образовательного портала. Продукт реализован в виде микрофронтендов.',
      companyName: 'Atox',
      companyDescription:
        'Поставщик корпоративного образовательного портала B2B',
      team: '2 frontend-разработчика, 1 backend-разработчик, QA и team lead.',
      stack:
        'React, TypeScript, Redux Toolkit, RTK Query, Jest, React Testing Library, Chakra UI.',
      tasks: [
        {
          title:
            'Разработка и поддержка пользовательских сценариев личного кабинета',
          description:
            'ЛК представляет собой каталог курсов, вложенную навигацию и отображение статистики и прогресса обучения.',
        },
        {
          title: 'Участие в миграции с Axios на RTK Query',
          description:
            'Переработка существующей реализации с сохранением бизнес-логики, удаление устаревшего кода, согласование и синхронизация изменений.',
        },
        {
          title: 'Развитие UI Kit на базе Chakra UI',
          description:
            'Разработка компонентов, переиспользуемых в нескольких частях продукта и внутренних проектах компании.\n',
        },
        {
          title: 'Реализация компонентных и unit-тестов',
          description: 'Использование Jest и React Testing Library.',
        },
        {
          title: 'Интеграция и поддержка сбора продуктовой аналитики',
          description:
            'Подключение аналитики для пользовательских действий и ключевых элементов интерфейса через dataLayer.',
        },
        {
          title: 'Командная активность',
          description:
            'Участие в code review и оценке задач на командных грумингах.',
        },
      ],
      cases: [],
    },
  ],
};

export const ruTitles: Titles = {
  about: 'Обо мне',
  experience: 'Опыт',
  stack: 'Основной стек',
  job: {
    stack: 'Стек',
    tasks: 'Задачи',
    team: 'Команда',
  },
};
